{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "assault",
    "1": "cybercrime",
    "2": "dacoity_robbery",
    "3": "domestic_violence",
    "4": "fraud",
    "5": "kidnapping",
    "6": "murder",
    "7": "narcotics",
    "8": "other",
    "9": "rape_sexoff",
    "10": "theft"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "assault": 0,
    "cybercrime": 1,
    "dacoity_robbery": 2,
    "domestic_violence": 3,
    "fraud": 4,
    "kidnapping": 5,
    "murder": 6,
    "narcotics": 7,
    "other": 8,
    "rape_sexoff": 9,
    "theft": 10
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 197285
}
